InformationRegisters/НоменклатураОтделов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураОтделов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураОтделов/Ext/ManagerModule.bsl
Функция ПроверитьНаНаличиеОтдела(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураОтделов.Отдел КАК Отдел
		|ИЗ
		|	РегистрСведений.НоменклатураОтделов КАК НоменклатураОтделов
		|ГДЕ
		|	НоменклатураОтделов.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ПолучитьНоменклатуруОтделовСклада(Склад) Экспорт
	
	МассивНоменклатуры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спНоменклатура.Ссылка КАК тНоменклатура
		|ИЗ
		|	РегистрСведений.НоменклатураОтделов КАК НоменклатураОтделов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спНоменклатура
		|		ПО НоменклатураОтделов.Номенклатура = спНоменклатура.Родитель
		|ГДЕ
		|	НоменклатураОтделов.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивНоменклатуры;
	Иначе
		Пока Выборка.Следующий() Цикл
			МассивНоменклатуры.Добавить(Выборка.тНоменклатура);	
		КонецЦикла;
		
		Возврат МассивНоменклатуры;
	КонецЕсли;

КонецФункции
